{
  "_class_name": "GaussianDiffusion",
  "_diffusers_version": "0.30.3",
  "beta_schedule": "linear",
  "num_train_timesteps": 1000,
  "rescale_timesteps": false,
  "steps_offset": 0,
  "timestep_spacing": "leading"
}
